Revit 2026 API

# GenericZoneCreateSpaceBased Method

---
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static GenericZone CreateSpaceBased(
	Document doc,
	ElementId typeId,
	string name,
	GenericZoneDomainData domainData,
	ElementId levelId,
	ISet<ElementId> spaceIds
)
```
```vb
Public Shared Function CreateSpaceBased (
	doc As Document,
	typeId As ElementId,
	name As String,
	domainData As GenericZoneDomainData,
	levelId As ElementId,
	spaceIds As ISet(Of ElementId)
) As GenericZone
```
```cpp
public:
static GenericZone^ CreateSpaceBased(
	Document^ doc,
	ElementId^ typeId,
	String^ name,
	GenericZoneDomainData^ domainData,
	ElementId^ levelId,
	ISet<ElementId^>^ spaceIds
)
```
```fsharp
static member CreateSpaceBased :
        doc : Document *
        typeId : ElementId *
        name : string *
        domainData : GenericZoneDomainData *
        levelId : ElementId *
        spaceIds : ISet<ElementId> -> GenericZone
```

#### Parameters

doc Document

typeId ElementId

name String

domainData GenericZoneDomainData

levelId ElementId

spaceIds ISetElementId

#### Return Value

GenericZone

#### Reference

GenericZone Class

Autodesk.Revit.DB.Analysis Namespace